#include <iostream>

int main() {
	using namespace std;
	setlocale(LC_ALL, "Russian");
	//1

//	char const* strs[] = {
//		"\"To be",
//		"or not",
//		"to be...\"",
//		"/ Shakespeare /"
//	};
//
//	cout << "\t" << strs[0] << endl;
//	cout << "\t\t" << strs[1] << endl;
//	cout << "\t\t\t" << strs[2] << endl;
//	cout << "\t\t\t\t" << strs[3] << endl;


	//2

//	char const* str = "I love C++!";
//	size_t const STRINGS = 5;
//	for (size_t i = 0; i < STRINGS; ++i) {
//		for (size_t j = 0; j <= i; ++j) {
//			cout << "\t";
//		}
//		cout << str << endl;
//	}

	//3

   //cout << "\'\\t\', " << "\'\\n\', " << "\'\\\\', " << "\'\\'\', " << "\'\\\"\'." << endl;

	//4

//	char const* strs[] = {
//		"#include <iostream>",
//		"int main() {",
//		"\tusing namespace std;",
//		"\tsetlocale(LC_ALL, \"Russian\");",
//		"\tcout << \"\'\\t\', \" << \"\'\\n\', \" << \"\'\\\\', \" << \"\'\\'\', \" << \"\'\\\"\'.\" << endl;",
//		"\treturn 0;",
//		"}"
//	};
//	size_t STRINGS = sizeof strs / sizeof strs[0];
//	for (size_t i = 0; i < STRINGS; ++i) {
//		cout << strs[i] << endl;
//	}

	//5

//	char const* strs[] = {
//		"Май 2021",
//		"Пн\tВт\tСр\tЧт\tПт\tСб\tВс",
//		"26\t27\t28\t29\t30\t1\t2",
//		"3\t4\t5\t6\t7\t8\t9",
//		"10\t11\t12\t13\t14\t15\t16",
//		"17\t18\t19\t20\t21\t22\t23",
//		"24\t25\t26\t27\t28\t29\t30",
//		"31\t1\t2\t3\t4\t5\t6"
//	};
//	size_t STRINGS = sizeof strs / sizeof strs[0];
//	for (size_t i = 0; i < STRINGS; ++i) {
//		cout << strs[i] << endl;
//	}

	//6

//	char const* strs[] = {
//		"                  *  **",
//		"                *    ***",
//		"              *        *",
//		"            **************",
//		"            * ****  **** *",
//		" *   *   *  * *  *  *  * *  *   *   *",
//		"* * * * * * * ****  *  * * * * * * * *",
//		"* * * * * * *       **** * * * * * * *",
//		"* * * * * * ************** * * * * * *",
//
//	};
//	size_t STRINGS = sizeof strs / sizeof strs[0];
//	for (size_t i = 0; i < STRINGS; ++i) {
//		cout << strs[i] << endl;
//	}

	//7

//	char const* strs[] = {
//		"                     Grishchuk Dmitry Ivanovich",
//		"                                  *",
//		"                                  *",
//		"                                  *",
//		"                                 * *",
//		"                                *   *",
//		"       Grishchuk Ivan Dmitrievich   Grishchuk Lubov Vasilievna",
//		"                      *                            *",
//		"                      *                            *",
//		"                      *                            *",
//		"                     * *                          * *",
//		"                    *   *                        *   *",
//		"             Ded Dima   Babushka Milia   Ded Vasia   Babushka Masha"
//	};
//	size_t const STRINGS = sizeof strs / sizeof strs[0];
//	for (size_t i = 0; i < STRINGS; ++i) {
//		cout << strs[i] << endl;
//	}


    //8

//    char const* strs[] = {
//		"          *****          **       **  **            **           *",
//		"         *******         ***      **  ***          ***          ***",
//		"        **     **        ****     **  ****        ****         ** **",
//		"       **       **       ** **    **  ** **      ** **        **   **",
//		"      **         **      **  **   **  **  **    **  **       **     **",
//		"     **           **     **   **  **  **   **  **   **      **       **",
//		"  *********************  **    ** **  **    ****    **     *************",
//		"  *********************  **     ****  **     **     **    ***************",
//		"   **               **   **      ***  **            **   **             **",
//		"    *               *    **       **  **            **  **               **"
//	};
//	size_t const STRINGS = sizeof strs / sizeof strs[0];
//	for (size_t i = 0; i < STRINGS; ++i) {
//		cout << strs[i] << endl;
//	}


	//9

//	char const* strs[] = {
//		"     *    *",
//		"             *         *",
//		"*",
//		"",
//		"               *      *"
//	};
//	size_t const STRINGS = sizeof strs / sizeof strs[0];
//	for (size_t i = 0; i < STRINGS; ++i) {
//		cout << "\t" << strs[i] << endl;
//	}

    //10

	char const* strs[] = {
        "\tИванов Иван Иванович",
        "\tЛичные данные:      Возраст: 22 года",
        "\tСемейное положение: холост",
        "",
        "",
        "",
        "Контактная информация:	Адрес: г. Хабаровск, ул. Стрельникова",
        "Телефон: 8-000-000-00-00",
        "E-mail: IVANKO_8000000@ yandex. ru",
        "",
        "",
        "",
        "Цель:",
        "Устроиться на интересную работу с достойной оплатой и перспективой",
        "карьерного роста в сфере экономики, финансов, банковской сфере или логистики.",
        "",
        "",
        "Специальность: «Математические методы и модели исследования операций вэкономике»",
        "",
        "",
        "Средний балл зачетной книжки: 4,0",
        "2000-2003 - Лицей информационных технологий.",
        "",
        "",
        "Опыт работы и полученные про фессиональные навыки (практика):",
        "2007; 2008 гг. «Аэронавигация Дальнего Востока»",
        "Стажер (производственная практика):",
        "- использовал анализ уровней и закономерностей развития экономических систем и ",
        "отдельных процессов, их объективная оценка, планирование",
        "и прогнозирование развитие",
        "отраслей и предприятий с применением математических методов,",
        "информационных технологий;",
        "- провел комплексный анализ хозяйственной деятельности предприятия современными",
        "средствами анализа и прогнозирования финансово-экономических ситуаций.",
        "",
        "",
        "Дополнительные навыки и интересы	 Английский язык – средний уровень",
        "(перевожу технические тесты и свободно говорю);",
        "Опытный пользователь ПК. Работаю в программах: КОМПАС; AutoCad; ANSYS и др.",
        "Имею водительские права категории В.",
        "",
        "",
        "Личные достижения:	 Победитель олимпиады «1С-Карьера» г. Красноярск 2009.",
        "Занял 2 место в олимпиаде по математике ТОГУ, 2005г.",
        "Имею 1 разряд по шахматам.",
        "",
        "",
        "Личные качества:",
        "Ответственный, легко обучаемый, имею организаторские способности.",
        "Веду здоровый образ жизни."
	};
	size_t const STRINGS = sizeof strs / sizeof strs[0];
	for (size_t i = 0; i < STRINGS; ++i) {
		cout << strs[i] << endl;
	}
	return 0;
}
